home/emacs/conf/init.org
---
title: Emacs Configuration
---
#+PROPERTY: header-args :tangle "init.el"
#+TITLE: My Emacs configuration
#+TOC: headlines 2

This is my literate init.el file. There are a lot of highly opinionated choices
here! My config is in a constant state of disrepair. If you’re reading this on
my website, then this is probably quite close to my current config since this
file is updated by the website’s build script.

* Internals
** Performance
Increase gc threshold. This is at the top of the file to ensure that
it benfits startup time of stuff later on.
#+BEGIN_SRC emacs-lisp
;; -*- lexical-binding: t; -*-
(setq read-process-output-max (* 1024 1024)) ;; 1mb
(setq gc-cons-threshold 100000000)
#+END_SRC

** Packages & Straight bootstrapping
I use [[https://github.com/raxod502/straight.el][straight.el]] for my package management. I find it to be much more flexible than
plain use-package or package.el. Also, it has much better portability and
version stability. Finally, I find its recipe-writing features very
nice, with the killer feature being clean support for forks, since I
fork emacs packages on a somewhat regular basis.

#+BEGIN_SRC emacs-lisp
(setq straight-check-for-modifications nil)
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
    (url-retrieve-synchronously
     "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
     'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(setq straight-built-in-pseudo-packages '(project))
#+end_src

straight-use-package is a bit of a keyful to type, especially interactively.
#+BEGIN_SRC emacs-lisp
(defalias 'sup 'straight-use-package)
#+END_SRC

** JIT
I use a custom compiled version of emacs with native compilation enabled. The
first line enabled deferred comp so that elisp is compiled async when its first
called. The second line is so that I don’t see annoying popups every time.
#+BEGIN_SRC emacs-lisp
(setq comp-deferred-compilation t)
(setq warning-suppress-log-types '((comp)))
#+END_SRC

If the variable doesn't exist, setq won't error (it'll make and intern
the new variable) and it'll do nothing.

** Macros
Some macros that are used in this file:
*** Better hooks
Hook to add multiple functions and forms to a hook. This accepts any
number of arguments where the first is the (quoted) hook itself, and
each element is either an unquoted symbol, in which its treated as a
function, or a form in which case it is inserted directly.

#+BEGIN_SRC emacs-lisp
(defmacro add-fs-to-hook (hook &rest funcs)
  "Add functions to hook. A function is either an unquoted token, or a form.
If it's a token, then its treated as a function and enabled. Otherwise, the form is run."
  `(add-hook ,hook
             (fn ,@(mapcar (lambda (el)
                             (if (listp el)
                                 el
                               (list el 1)))
                           funcs))))
#+END_SRC

Sometimes its helpful to think about adding a single function to many
hooks. Everything should be quoted here.
#+BEGIN_SRC emacs-lisp
(defmacro add-to-hooks (f &rest hooks)
  "Add a single function to many quoted hooks"
  `(progn ,@(mapcar (lambda (hook)
                      `(add-hook ,hook ,f))
                    hooks)))
#+END_SRC

*** Nullary lambda
#+BEGIN_SRC emacs-lisp
(defmacro fn (&rest forms)
  (declare (indent 0))
  `(lambda () ,@forms))
#+END_SRC

*** Furcula
Implementation of the furcula (branching arrow) as described in the
[[https://github.com/rplevy/swiss-arrows][swiss-arrows]] macroset for clojure. I am a huge fan of this idea, and I
included an implementation of it in my janet fork, [[https://github.com/eshrh/matsurika][matsurika.]] The
basic idea is that the first entry will get inserted as either the
first or last item (argument, usually) in every subsequent lisp form,
or function. The result is then a list of the execution of all of
these forms or functions. For instance, =(-< 5 (+ 1) (* 2) (- 1))=
results in ='(6 10 4)=. Things can get really exciting when you start
combining =-<= and =->>=!


This particular implementation comes from Adam Porter's (alphapapa)
code from his 2018 proposal to dash.el. Kind of bummed this never got merged.
#+BEGIN_SRC emacs-lisp
(defmacro -< (expr &rest forms)
  (declare (indent defun))
  (let ((var (gensym)))
    `(let ((,var ,expr))
       (list ,@(--map (pcase it
                        ((pred symbolp) (list it var))
                        ((pred listp) (-snoc it var)))
                      forms)))))

(defmacro -<< (expr &rest forms)
  (declare (indent defun))
  (let ((var (gensym)))
    `(let ((,var ,expr))
       (list ,@(--map (pcase it
                        ((pred symbolp) (list it var))
                        (`(,first . ,rest) `(,first ,var ,@rest)))
                      forms)))))
#+END_SRC

** Libraries
Classic libraries I use regularly.
+ s :: good string manipulation
+ dash :: functional programming essentials like threading (piping,
  not multithreading) and
  recursive style list manipulation
#+BEGIN_SRC emacs-lisp
(sup 's)
(sup 'dash)
#+END_SRC

** Readline muscle memory compatibility
Too used to the command line, make C-h backspace and C-x h help.

#+BEGIN_SRC emacs-lisp
(global-set-key [?\C-h] 'delete-backward-char)
(global-set-key [?\C-x ?h] 'help-command)
#+END_SRC

Not exactly readliney, but close enough for me. ~C-z~ (and ~C-u~) in readline like
systems typically kills backward only.
#+BEGIN_SRC emacs-lisp
(global-set-key [?\C-z] #'kill-whole-line)
#+END_SRC
** C-x remap
Important code that switches ~C-x~ and ~C-u~. This is helpful for me
because I use dvorak, and ~C-x~ is far more common and useful compared
te ~C-u~. This must be at the end of the file because it basically
redefines every other command that I bound to the ~C-x~ prefix anywhere
above.
#+BEGIN_SRC emacs-lisp
(define-key key-translation-map [?\C-x] [?\C-u])
(define-key key-translation-map [?\C-u] [?\C-x])
#+END_SRC

** Tramp config
Some tramp-specific config mainly to make it smoother/faster.

#+BEGIN_SRC emacs-lisp
(setq vc-handled-backends '(Git))
(setq remote-file-name-inhibit-locks t)
(setq remote-file-name-inhibit-cache nil)
#+END_SRC

* Visual configuration
** Disable bell
I don’t know who thought it was a good idea to include this.
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
#+END_SRC

** Disable UI bloat
Turn off the menu-bar, tool-bar, an scroll-bar. I hate bars!

The tool bar and the menu bar can be turned off by calling their
functions with the ~-1~ argument of course, but doing it this way shaves
off actually a significant amount of time from startup. I don't
(anymore) run emacs in a daemon, so startup time is somewhat valuable
to me.

#+BEGIN_SRC emacs-lisp
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(menu-bar-lines . 0) default-frame-alist)
(scroll-bar-mode -1)
(setq use-dialog-box nil)
#+END_SRC

** Better parenthesis location

I can’t count parentheses. I use an advice override to change how the
parenthesis locating functionality works. This is because I use a block
cursor with meow, which makes cursor position slightly deceptive.

Basically, the block cursor by default highlights the parenthesis when
your cursor is immediately AFTER the parenthesis in question, because
the point is always between two characters in emacs (the point is
really right after the parenthesis as well). So, if you have nested
parentheses, as we often do, it's strange to see the "wrong
parenthesis" highlighted.

This advice first checks before the point and only then after the point
for a parenthesis. I think this behavior is very intuitive. The defined
function overrides the internal function used to find parentheses.

#+BEGIN_SRC emacs-lisp
(column-number-mode)
(show-paren-mode)
(defun show-paren--locate-near-paren-ad ()
  "Locate an unescaped paren \"near\" point to show.
If one is found, return the cons (DIR . OUTSIDE), where DIR is 1
for an open paren, -1 for a close paren, and OUTSIDE is the buffer
position of the outside of the paren.  Otherwise return nil."
  (let* ((before (show-paren--categorize-paren (point))))
    (when (or
       (eq (car before) 1)
       (eq (car before) -1))
      before)))

(advice-add 'show-paren--locate-near-paren
            :override #'show-paren--locate-near-paren-ad)
#+END_SRC

** Colorize color strings.
#+BEGIN_SRC emacs-lisp
(sup 'rainbow-mode)
(add-hook 'prog-mode #'rainbow-mode)
#+END_SRC

** Auto whitespace cleanup
Couldn't be bothered to care about whitespace myself. Didn't we make
computers to do repetitive stuff for us??
#+BEGIN_SRC emacs-lisp
(add-fs-to-hook 'prog-mode-hook
                (add-hook 'after-save-hook
                          (fn (whitespace-cleanup))))
#+END_SRC

** Fonts

My default fonts. Iosevka Meiseki is a customized version of [[https://github.com/be5invis/iosevka][iosevka]]
font. You can find a copy of it [[https://esrh.me/files/iosevka-meiseki-sans-regular.ttf][here]].

#+BEGIN_SRC emacs-lisp
(defvar emacs-english-font "monospace")
(defvar emacs-cjk-font "IPAGothic")
(setq my-font (concat emacs-english-font "-12"))

(add-to-list 'default-frame-alist `(font . ,my-font))
(set-face-attribute 'default t :font my-font)
#+END_SRC

** Theme
I've tried countless other themes, but somehow I just keep coming back
to gruvbox. I switch between ~gruvbox-light-hard~ and ~gruvbox-dark-hard~
fairly often though, both are nice. I'm a big fan of the dark
version's warm and retro-y feel, its visually distinct and comfy.

#+BEGIN_SRC emacs-lisp
(sup 'gruvbox-theme)

(load-theme 'gruvbox-dark-hard t nil)
#+END_SRC

** Frame
Make the title look better so that my status bar can print it nicely
for the rice screenshots. ~%b~ is substituted for the name of the
currently active buffer.
#+BEGIN_SRC emacs-lisp
(setq-default frame-title-format '("emacs: %b"))
#+END_SRC

** Modeline
I've liked smart-mode-line in the past, but I prefer telephone line's
modularity, design, and visual appeal right now.

#+BEGIN_SRC emacs-lisp
(sup 'telephone-line)
#+END_SRC

Use a neat cubic curved shape to separate segments.
#+BEGIN_SRC emacs-lisp
(require 'telephone-line)
(setq telephone-line-primary-left-separator 'telephone-line-cubed-left
      telephone-line-secondary-left-separator 'telephone-line-cubed-hollow-left
      telephone-line-primary-right-separator 'telephone-line-cubed-right
      telephone-line-secondary-right-separator 'telephone-line-cubed-hollow-right)
(setq telephone-line-height 24)
#+END_SRC

~evil-use-short-tag~ makes telephone-line's meow segment, which I wrote
and upstreamed, use single letters to show meow state instead of the
whole word, so like "N" instead of "NORMAL".
#+BEGIN_SRC emacs-lisp
(setq telephone-line-evil-use-short-tag t)
#+END_SRC

