home/emacs/conf/init.org
*** Custom segments
One of the big reasons I like telephone line is the absolute ease of
defining new segments that look nice as hell.

#+BEGIN_SRC emacs-lisp
(telephone-line-defsegment* telephone-line-simpler-major-mode-segment ()
  (concat "["
          (if (listp mode-name)
              (car mode-name)
            mode-name)
          "]"))
#+END_SRC

This segment is a simpler indicator of position. I don't use line numbers on
the side of my screen, so it's pretty neccessary for me to quickly parse my
position at a glance. Column numbers are on the left since they change more
often, and this segment is the leftmost element on the right side of my bar.
This means that there's no unnecessary movement.

#+BEGIN_SRC emacs-lisp
(telephone-line-defsegment* telephone-line-simple-pos-segment ()
  (concat "%c : " "%l/" (number-to-string (count-lines (point-min) (point-max)))))
#+END_SRC

*** Segment setup
The meat of my line config.
#+BEGIN_SRC emacs-lisp
(setq telephone-line-lhs
      '((nil . (telephone-line-projectile-buffer-segment))
        (accent . (telephone-line-simpler-major-mode-segment))
        (nil . (telephone-line-meow-tag-segment
                telephone-line-misc-info-segment)))
      telephone-line-rhs
      '((nil . (telephone-line-simple-pos-segment))
        (accent . (telephone-line-buffer-modified-segment))))

(telephone-line-mode 1)
#+END_SRC

** Pixel scrolling
#+BEGIN_SRC emacs-lisp
(defun pixel-scroll-setup ()
  (interactive)
  (setq pixel-scroll-precision-large-scroll-height 1)
  (setq pixel-scroll-precision-interpolation-factor 1))

(when (boundp 'pixel-scroll-precision-mode)
  (pixel-scroll-setup)
  (add-hook 'prog-mode-hook #'pixel-scroll-precision-mode)
  (add-hook 'org-mode-hook #'pixel-scroll-precision-mode))
#+END_SRC

* Packages
** Nyaatouch
Nyaatouch is my personal modal editing system. It is highly optimized for the
dvorak keyboard and is built on meow (hence the name).

#+BEGIN_SRC emacs-lisp
(sup '(nyaatouch
       :repo "https://github.com/eshrh/nyaatouch"
       :fetcher github))
(turn-on-nyaatouch)
#+END_SRC

Nyaatouch brings in some packages as dependencies: avy, swiper, meow,
smartparens. You can find more information about it at the repo.
*** Just exchange point and mark
I use C-x C-x to return to a point more than I use it to reverse
selection. Meow uses kmacros, so I have to redefine the macro used
when meow-reverse is called as well.

#+BEGIN_SRC emacs-lisp
(defun just-exchange-point-and-mark ()
  (interactive)
  (call-interactively #'exchange-point-and-mark)
  (deactivate-mark))

(global-set-key (kbd "C-x C-x") #'just-exchange-point-and-mark)
(global-set-key (kbd "C-x 9 1") #'exchange-point-and-mark) ; unused key
(setq meow--kbd-exchange-point-and-mark "C-x 9 1")
#+END_SRC

** Far

Add a meow keybind for paragraph filling.

#+BEGIN_SRC emacs-lisp
(straight-use-package
 '(far :type git
       :repo "https://github.com/eshrh/far.el"))

(meow-normal-define-key
 '("`" . far-fill-paragraph))
#+END_SRC

Far.el is an implementation of [[https://stephen-huan.github.io/blog/far/][far]], a DP-based paragraph filling
algorithm that minimizes variance of line lengths.

** Undo-tree
Better undo for emacs. I really enjoy the tree visualization feature
this package adds. If you haven't checked it out, try pressing ~C-x u~!
#+BEGIN_SRC emacs-lisp
(sup 'undo-tree)
(global-undo-tree-mode)
(setq undo-tree-auto-save-history nil)
#+END_SRC

** Ace-window
Ace-window is super nice because it lets you quickly switch to a window
when you have >2 open by providing a letter hint.
#+BEGIN_SRC emacs-lisp
(sup 'ace-window)
(global-set-key [remap other-window] 'ace-window)
(global-set-key (kbd "C-x w") 'ace-swap-window)
#+END_SRC

dvorak moment
#+BEGIN_SRC emacs-lisp
(setq aw-keys '(?a ?o ?e ?u ?i ?d ?h ?t ?n ?s))
#+END_SRC

don't hint me for things outside the frame
#+BEGIN_SRC emacs-lisp
(setq aw-scope 'frame)
#+END_SRC

I never want to switch to the current buffer
#+BEGIN_SRC emacs-lisp
(setq aw-ignore-current t)
(setq aw-background nil)
#+END_SRC

** Dashboard
An essential component of any
emacs-window-with-neofetch-and-tiling-wm-and-anime-girl-wp screenshot.
#+BEGIN_SRC emacs-lisp
(sup 'dashboard)
(dashboard-setup-startup-hook)
#+END_SRC

This is an important section because in order for dashboard to produce the org
agenda, every org file needs to be opened, which means your recent list is
just cluttered. The second line makes dashboard close each buffer
after opening them so it doesn't clutter up your buffer list.
#+BEGIN_SRC emacs-lisp
(setq recentf-exclude '("~/org/"))
(setq dashboard-agenda-release-buffers t)
#+END_SRC

Startup to the dashboard
#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice (get-buffer "*dashboard*"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq dashboard-center-content t)
(setq dashboard-show-shortcuts nil)
(setq dashboard-set-footer nil)
#+END_SRC

Declutter the items shown on the dashboard and change the section
names to be hip (lower case) and cool (shorter)
#+BEGIN_SRC emacs-lisp
(setq dashboard-items '((recents  . 5)
                        (projects . 5)
                        (agenda . 5)))
(setq dashboard-agenda-sort-strategy '(time-up))
(setq dashboard-item-names '(("Recent Files:" . "recent:")
                             ("Projects:" . "projects:")
                             ("Agenda for the coming week:" . "agenda:")))
#+END_SRC

Nice image and nice title. If we're in the terminal, display an ASCII gnu
instead.
#+BEGIN_SRC emacs-lisp
(setq dashboard-banner-logo-title "GNU emacsへようこそ。")

(defmacro set-dashboard-banner (name)
  `(setq dashboard-startup-banner
         (expand-file-name ,name user-emacs-directory)))
(if (or (display-graphic-p) (daemonp))
    (set-dashboard-banner "hiten_render_rsz.png")
  (set-dashboard-banner "gnu.txt"))
#+END_SRC

** Corfu
#+BEGIN_SRC emacs-lisp
(sup 'corfu)
(setq corfu-auto t)
(add-hook 'after-init-hook #'global-corfu-mode)
#+END_SRC
** Projectile
Project-aware emacs commands.
#+BEGIN_SRC emacs-lisp
(sup 'projectile)
(projectile-mode 1)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
#+END_SRC

The main feature I use from projectile is it's awesome fuzzy search for files
across your entire project. I use this so much that I use it as my default
find file function, only when I'm in a project.
#+BEGIN_SRC emacs-lisp
(defun find-file-or-projectile ()
  (interactive)
  (if (projectile-project-p)
      (call-interactively 'projectile-find-file)
    (call-interactively 'find-file)))

(global-set-key (kbd "C-x C-f") 'find-file-or-projectile)
;; just in case i need to use standard find file, probably to make a file.
(meow-leader-define-key '("U" . find-file))
#+END_SRC

** Searching
*** Vertico
#+BEGIN_SRC emacs-lisp
(sup '(vertico :files (:defaults "extensions/*")
               :includes (vertico-directory)))
(vertico-mode)
#+END_SRC

When using the find-file dialog, pressing backspace should take you
back up to the parent, not just delete one character.
#+BEGIN_SRC emacs-lisp
(define-key vertico-map (kbd "DEL") #'vertico-directory-delete-char)
#+END_SRC

*** Marginalia
An essential addition to the completing-read buffer that offers a bit of
documentation to entries.
#+BEGIN_SRC emacs-lisp
(sup 'marginalia)
(marginalia-mode)
#+END_SRC

*** Posframe
In GUI mode, I like to have all completing-read queries come up in a new frame
in the middle of my screen. Posframe does this with a child frame. I like how it
looks.

#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (sup 'vertico-posframe)
  (vertico-posframe-mode 1))
#+END_SRC

Specifically in gruvbox, the border is the same color as the
background for some silly reason. I intend to submit an issue for
this.

#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (set-face-background 'vertico-posframe-border
                       (face-attribute 'region :background)))
#+END_SRC

*** Orderless completion
#+BEGIN_SRC emacs-lisp
(sup 'orderless)
(setq completion-styles '(orderless basic)
      completion-category-defaults nil
      completion-category-overrides '((file (styles partial-completion))))
#+END_SRC

** Helpful
Better describe* functions that have more information and look neater.
For example helpful's describe-function includes the source code of
the function itself, which is very useful when writing elisp.
#+BEGIN_SRC emacs-lisp
(sup 'helpful)
#+END_SRC

Override keybindings.
#+BEGIN_SRC emacs-lisp
(-map (lambda (pair) (global-set-key
                 (kbd (concat "C-x h " (car pair))) (cdr pair)))
      (-zip-pair '("f" "v" "k")
            '(helpful-callable helpful-variable helpful-key)))
#+END_SRC

** Dired
Dired jump opens dired to the directory of the file visited by the
current buffer. Typically this is set to =C-x C-j= but this is mildly
uncomfortable to type on dvorak. =C-x d= is where dired with prompt is
originally.
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x d") #'dired-jump)
(global-set-key (kbd "C-x C-j") #'dired)
#+END_SRC

With two dired panes open, any command in one pane will autocomplete
to the path in the second pane.
#+BEGIN_SRC emacs-lisp
(setq dired-dwim-target t)
#+END_SRC

Don't show owner and perms by default. Pressing =(= toggles this off again.
#+BEGIN_SRC emacs-lisp
(add-fs-to-hook 'dired-mode-hook (dired-hide-details-mode 1))
#+END_SRC

Use only one dired directory at a time.
#+BEGIN_SRC emacs-lisp
(setq dired-kill-when-opening-new-dired-buffer t)
#+END_SRC

#+BEGIN_SRC emacs-lisp

  (add-fs-to-hook 'dired-mode-hook
                  (define-key dired-mode-map (kbd "-") #'swiper)
                  (define-key dired-mode-map (kbd "<") #'beginning-of-buffer)
                  (define-key dired-mode-map (kbd ">") #'end-of-buffer))
#+END_SRC

** Tree-sitter
Introduced in emacs 30.

#+BEGIN_SRC emacs-lisp
(setq treesit-available (and (fboundp 'treesit-available-p)
                             (treesit-available-p)))
#+END_SRC

Create a list of grammar urls.
#+BEGIN_SRC emacs-lisp
(when treesit-available
  (defun treesitter-grammar-url (lang)
    (concat "https://github.com/tree-sitter/tree-sitter-" lang))
  (setq treesit-langs
        '(bash c cpp haskell html java javascript julia rust python))
  (setq treesit-language-source-alist
        (--map `(,it . (,(treesitter-grammar-url (symbol-name it)))) treesit-langs)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun treesit-ensure (lang)
  (unless (treesit-language-available-p lang)
    (treesit-install-language-grammar lang)))
#+END_SRC

** Highlights
