home/emacs/conf/init.el

(telephone-line-defsegment* telephone-line-simpler-major-mode-segment ()
  (concat "["
          (if (listp mode-name)
              (car mode-name)
            mode-name)
          "]"))

(telephone-line-defsegment* telephone-line-simple-pos-segment ()
  (concat "%c : " "%l/" (number-to-string (count-lines (point-min) (point-max)))))

(setq telephone-line-lhs
      '((nil . (telephone-line-projectile-buffer-segment))
        (accent . (telephone-line-simpler-major-mode-segment))
        (nil . (telephone-line-meow-tag-segment
                telephone-line-misc-info-segment)))
      telephone-line-rhs
      '((nil . (telephone-line-simple-pos-segment))
        (accent . (telephone-line-buffer-modified-segment))))

(telephone-line-mode 1)

(defun pixel-scroll-setup ()
  (interactive)
  (setq pixel-scroll-precision-large-scroll-height 1)
  (setq pixel-scroll-precision-interpolation-factor 1))

(when (boundp 'pixel-scroll-precision-mode)
  (pixel-scroll-setup)
  (add-hook 'prog-mode-hook #'pixel-scroll-precision-mode)
  (add-hook 'org-mode-hook #'pixel-scroll-precision-mode))

(sup '(nyaatouch
       :repo "https://github.com/eshrh/nyaatouch"
       :fetcher github))
(turn-on-nyaatouch)

(defun just-exchange-point-and-mark ()
  (interactive)
  (call-interactively #'exchange-point-and-mark)
  (deactivate-mark))

(global-set-key (kbd "C-x C-x") #'just-exchange-point-and-mark)
(global-set-key (kbd "C-x 9 1") #'exchange-point-and-mark) ; unused key
(setq meow--kbd-exchange-point-and-mark "C-x 9 1")

(straight-use-package
 '(far :type git
       :repo "https://github.com/eshrh/far.el"))

(meow-normal-define-key
 '("`" . far-fill-paragraph))

(sup 'undo-tree)
(global-undo-tree-mode)
(setq undo-tree-auto-save-history nil)

(sup 'ace-window)
(global-set-key [remap other-window] 'ace-window)
(global-set-key (kbd "C-x w") 'ace-swap-window)

(setq aw-keys '(?a ?o ?e ?u ?i ?d ?h ?t ?n ?s))

(setq aw-scope 'frame)

(setq aw-ignore-current t)
(setq aw-background nil)

(sup 'dashboard)
(dashboard-setup-startup-hook)

(setq recentf-exclude '("~/org/"))
(setq dashboard-agenda-release-buffers t)

(setq initial-buffer-choice (get-buffer "*dashboard*"))

(setq dashboard-center-content t)
(setq dashboard-show-shortcuts nil)
(setq dashboard-set-footer nil)

(setq dashboard-items '((recents  . 5)
                        (projects . 5)
                        (agenda . 5)))
(setq dashboard-agenda-sort-strategy '(time-up))
(setq dashboard-item-names '(("Recent Files:" . "recent:")
                             ("Projects:" . "projects:")
                             ("Agenda for the coming week:" . "agenda:")))

(setq dashboard-banner-logo-title "GNU emacsへようこそ。")

(defmacro set-dashboard-banner (name)
  `(setq dashboard-startup-banner
         (expand-file-name ,name user-emacs-directory)))
(if (or (display-graphic-p) (daemonp))
    (set-dashboard-banner "hiten_render_rsz.png")
  (set-dashboard-banner "gnu.txt"))

(sup 'corfu)
(setq corfu-auto t)
(add-hook 'after-init-hook #'global-corfu-mode)

(sup 'projectile)
(projectile-mode 1)
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)

(defun find-file-or-projectile ()
  (interactive)
  (if (projectile-project-p)
      (call-interactively 'projectile-find-file)
    (call-interactively 'find-file)))

(global-set-key (kbd "C-x C-f") 'find-file-or-projectile)
;; just in case i need to use standard find file, probably to make a file.
(meow-leader-define-key '("U" . find-file))

(sup '(vertico :files (:defaults "extensions/*")
               :includes (vertico-directory)))
(vertico-mode)

(define-key vertico-map (kbd "DEL") #'vertico-directory-delete-char)

(sup 'marginalia)
(marginalia-mode)

(when (display-graphic-p)
  (sup 'vertico-posframe)
  (vertico-posframe-mode 1))

(when (display-graphic-p)
  (set-face-background 'vertico-posframe-border
                       (face-attribute 'region :background)))

(sup 'orderless)
(setq completion-styles '(orderless basic)
      completion-category-defaults nil
      completion-category-overrides '((file (styles partial-completion))))

(sup 'helpful)

(-map (lambda (pair) (global-set-key
                 (kbd (concat "C-x h " (car pair))) (cdr pair)))
      (-zip-pair '("f" "v" "k")
            '(helpful-callable helpful-variable helpful-key)))

(global-set-key (kbd "C-x d") #'dired-jump)
(global-set-key (kbd "C-x C-j") #'dired)

(setq dired-dwim-target t)

(add-fs-to-hook 'dired-mode-hook (dired-hide-details-mode 1))

(setq dired-kill-when-opening-new-dired-buffer t)

  (add-fs-to-hook 'dired-mode-hook
                  (define-key dired-mode-map (kbd "-") #'swiper)
                  (define-key dired-mode-map (kbd "<") #'beginning-of-buffer)
                  (define-key dired-mode-map (kbd ">") #'end-of-buffer))

(setq treesit-available (and (fboundp 'treesit-available-p)
                             (treesit-available-p)))

(when treesit-available
  (defun treesitter-grammar-url (lang)
    (concat "https://github.com/tree-sitter/tree-sitter-" lang))
  (setq treesit-langs
        '(bash c cpp haskell html java javascript julia rust python))
  (setq treesit-language-source-alist
        (--map `(,it . (,(treesitter-grammar-url (symbol-name it)))) treesit-langs)))

(defun treesit-ensure (lang)
  (unless (treesit-language-available-p lang)
    (treesit-install-language-grammar lang)))
