home/emacs/conf/init.org
*** Lisp highlighting
Install a bunch of Fanael’s visual packages to make lisp source editing much
nicer.
+ highlight-defined: highlight known symbols instead of just the built in ones
+ highlight-numbers: numbers
+ highlight-delimiters: highlight brackets and parens nicely
+ highlight-quoted: highlight quoted symbols in a different color
  [applies only to elisp]

I really do find these pretty essential for comfortable lisp
programming, but maybe just because I'm so used to them.
#+BEGIN_SRC emacs-lisp
(sup 'highlight-defined)
(sup 'highlight-numbers)
(sup 'rainbow-delimiters)
(sup 'highlight-quoted)
(defun highlight-lisp-things-generic ()
  (highlight-numbers-mode)
  (highlight-defined-mode)
  (rainbow-delimiters-mode))
#+END_SRC

The function ~highlight-lisp-things-generic~ does *not* include
highlight-quoted, which only makes sense for emacs lisp

#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook #'highlight-quoted-mode)
(add-to-hooks #'highlight-lisp-things-generic 'lisp-data-mode-hook 'clojure-mode-hook)
#+END_SRC

Most lisp modes inherit from lisp-data-mode. Clojure-mode does not.
*** Highlight todos
#+BEGIN_SRC emacs-lisp
(sup 'hl-todo)
(global-hl-todo-mode)
#+END_SRC

*** Highlight current line
I find this very helpful not only to quickly locate the cursor, but to
read code in general. It helps me focus, especially when stepping
through code line by line.

#+BEGIN_SRC emacs-lisp
(global-hl-line-mode)
#+END_SRC

** Terminal and shell config
Vterm is undoubtedly the best terminal in emacs. Depends
on the module libvterm, which means your emacs has to be
compiled with module support enabled (damn you Ubuntu!!).

#+BEGIN_SRC emacs-lisp
(sup 'vterm)
(sup 'fish-mode)
#+END_SRC

*** Config
Make hl-line-mode turn off in vterm-mode.
#+BEGIN_SRC emacs-lisp
(add-fs-to-hook 'vterm-mode-hook (setq-local global-hl-line-mode
                                             (null global-hl-line-mode)))
#+END_SRC

Kill the buffer when ~C-d~ is pressed to exit the shell.
#+BEGIN_SRC emacs-lisp
(setq vterm-kill-buffer-on-exit t)
#+END_SRC

Change the name of the buffer
#+BEGIN_SRC emacs-lisp
(setq vterm-buffer-name-string "vt")
#+END_SRC

Start vterm mode in the insert meow state.
#+BEGIN_SRC emacs-lisp
(add-to-list 'meow-mode-state-list '(vterm-mode . insert))
#+END_SRC

*** Vterm-toggle
Toggles a window with a re-usable vterm. Good for reducing buffer clutter.

#+BEGIN_SRC emacs-lisp
(sup 'vterm-toggle)
(setq vterm-toggle-hide-method 'delete-window)
(setq vterm-toggle-fullscreen-p nil)
(add-to-list 'display-buffer-alist
             '((lambda (buffer-or-name _)
                 (let ((buffer (get-buffer buffer-or-name)))
                   (equal major-mode 'vterm-mode)))
               (display-buffer-reuse-window display-buffer-at-bottom)
               (dedicated . t)
               (reusable-frames . visible)
               (window-height . 0.3)))
#+END_SRC

*** Kill vterm buffer and window
#+BEGIN_SRC emacs-lisp
(defun vterm--kill-vterm-buffer-and-window (process event)
  "Kill buffer and window on vterm process termination."
  (when (not (process-live-p process))
    (let ((buf (process-buffer process)))
      (when (buffer-live-p buf)
        (with-current-buffer buf
          (kill-buffer)
          (ignore-errors (delete-window))
          (message "VTerm closed."))))))

(add-fs-to-hook 'vterm-mode-hook
                (set-process-sentinel (get-buffer-process (buffer-name))
                                      #'vterm--kill-vterm-buffer-and-window))
#+END_SRC
*** Keybindings

#+BEGIN_SRC emacs-lisp
(meow-leader-define-key
 '("d" . vterm-toggle-cd))
#+END_SRC

** Org-mode

Path configuration. I use a directory called org in my home directory to store
my org files.
#+BEGIN_SRC emacs-lisp
(when (file-exists-p "~/org/")
  (setq org-directory "~/org/")
  (setq org-agenda-files '("~/org/")))
#+END_SRC

Allow lists like a) b) c)
#+BEGIN_SRC emacs-lisp
(setq org-list-allow-alphabetical t)
#+END_SRC

Enable and disable some modes on opening an org buffer
+ Indent-mode means that star headings are hidden and hierarchy is
  whitespace-based
+ Turn off electrict quote completion because it makes typing elisp quotes annoying.
+ Turn on auto-fill mode to prevent lines from getting too long.
#+BEGIN_SRC emacs-lisp
(add-fs-to-hook 'org-mode-hook
                org-indent-mode
                (electric-quote-mode -1)
                auto-fill-mode)

#+END_SRC

Don't insert lines in between headers and list items.
#+BEGIN_SRC emacs-lisp
(setf org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
#+END_SRC

Change the backends.
#+BEGIN_SRC emacs-lisp
(sup 'ox-pandoc)
(setq org-export-backends '(latex beamer md html odt ascii pandoc))
#+END_SRC

Don't indent code in org-babel
#+BEGIN_SRC emacs-lisp
(setq org-edit-src-content-indentation 0)
#+END_SRC

Even emacs can’t make me not procrastinate!
#+BEGIN_SRC emacs-lisp
(setq org-deadline-warning-days 2)
#+END_SRC

Babel src setup
#+BEGIN_SRC emacs-lisp
(setq org-src-fontify-natively t
      org-confirm-babel-evaluate nil
      org-src-preserve-indentation t)
#+END_SRC

*** Org-fragtog
A neat little package to render latex fragments as you write them.
#+BEGIN_SRC emacs-lisp
(sup 'org-fragtog)
#+END_SRC

Quick function to disable fragtogging while in a table
#+BEGIN_SRC emacs-lisp
(defun org-inside-latex-block ()
  (eq (nth 0 (org-element-at-point)) 'latex-environment))
(setq org-fragtog-ignore-predicates '(org-at-table-p org-inside-latex-block))
#+END_SRC

*** Org-ref
Cool package to deal with citations in org. Especially nice when writing latex
in org-mode.

My typical workflow involves importing papers into [[https://www.zotero.org/][zotero]], which will
automatically update a system-wide bibliography file stored in bibtex thanks to
the [[https://retorque.re/zotero-better-bibtex/][better bibtex]] extension, which is essential.

#+BEGIN_SRC emacs-lisp
(sup 'org-ref)
(sup 'ivy-bibtex)

(setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
      org-ref-insert-cite-function 'org-ref-cite-insert-ivy
      org-ref-insert-label-function 'org-ref-insert-label-link
      org-ref-insert-ref-function 'org-ref-insert-ref-link
      org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body)))

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "s-<return>") 'org-meta-return)
  (define-key org-mode-map (kbd "C-c ]") 'org-ref-insert-link)
  (define-key org-mode-map (kbd "S-]") 'org-ref-insert-link-hydra/body)
  (define-key org-mode-map (kbd "C-c r") 'org-ref-citation-hydra/body))
(setq bibtex-completion-bibliography '("~/docs/library.bib"))
(setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
#+END_SRC

*** Org-roam
#+BEGIN_SRC emacs-lisp
(sup 'org-roam)
(setq org-roam-v2-ack t)
#+END_SRC

Basic setup. ~org-roam-db-autosync-mode~ is nice, but adds about 1.5s to my
startup time. Not good!

#+BEGIN_SRC emacs-lisp
(unless (file-directory-p "~/roam")
  (make-directory "~/roam"))
(setq org-roam-directory (file-truename "~/roam"))

#+END_SRC

Pressing enter while your point is on a link should follow the link.
#+BEGIN_SRC emacs-lisp
(setq org-return-follows-link t)
#+END_SRC

Keybindings for my most used roam actions. ~publish.el~ refers to a personal
elisp file I use to generate a website from my roam files you can find [[https://notes.esrh.me][here!]]
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c c i") #'org-roam-node-insert)
(global-set-key (kbd "C-c c f") #'org-roam-node-find)
(global-set-key (kbd "C-c c s") #'org-roam-db-sync)
(global-set-key (kbd "C-c c p") (fn (interactive) (load-file "~/roam/publish.el")))

#+END_SRC

The default file name looks ugly and leads to ugly urls once exported. This
makes the filenames just the titles.
#+BEGIN_SRC emacs-lisp
(setq org-roam-capture-templates
      '(("d" "default" plain "%?" :target
         (file+head "${slug}.org" "#+title: ${title}\n")
         :unnarrowed t)))
#+END_SRC

*** Latex
Adds my favorite document class, IEEE transactions to the org latex export.
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
               '("IEEEtran"
                 "\\documentclass{IEEEtran}"
                 ("\\section{%s}" . "\\section*{%s}")
                 ("\\subsection{%s}" . "\\subsection*{%s}")
                 ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))

#+END_SRC

** IRC
I store some IRC secrets outside of dotfile version control.

#+BEGIN_SRC emacs-lisp
(setq erc-default-server "irc.libera.chat")

(add-hook 'erc-before-connect (lambda (SERVER PORT NICK)
                                (when (file-exists-p "ircconfig.elc")
                                  (load-file
                                   (expand-file-name
                                    "ircconfig.elc"
                                    user-emacs-directory)))))
#+END_SRC

** YASnippet
Just works!
#+BEGIN_SRC emacs-lisp
(sup 'yasnippet)
(yas-global-mode)
(setq yas-indent-line 'fixed)
#+END_SRC

** Magit
Nothing to be said here
#+BEGIN_SRC emacs-lisp
(sup 'magit)
#+END_SRC

Ediff makes dealing with merging conflicts extremely comfortable. I make some
quick changes to how it lays out merge windows.
#+BEGIN_SRC emacs-lisp
(setq ediff-diff-options "")
(setq ediff-custom-diff-options "-u")
(setq ediff-window-setup-function 'ediff-setup-windows-plain)
(setq ediff-split-window-function 'split-window-vertically)
#+END_SRC

