home/emacs/conf/init.org
** Ligatures and symbols
Prettify symbols is emacs' built in method for symbol replacment. Any
string of any length can be replaced by a character. The
prettify-symbols-alist is buffer local, so it can be modified via
hook.

#+BEGIN_SRC emacs-lisp
(global-prettify-symbols-mode)
(add-fs-to-hook 'emacs-lisp-mode-hook
                (push '("fn" . ?∅) prettify-symbols-alist))
#+END_SRC

Ligature.el provides true ligatures.
#+BEGIN_SRC emacs-lisp
(sup 'ligature)
(ligature-set-ligatures
 'prog-mode
 '(  "|||>" "<|||" "<==>" "<!--" "~~>" "***" "||=" "||>"   "://"
     ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
     "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
     "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
     "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
     "..." "+++" "/==" "///" "_|_" "&&" "^=" "~~" "~@" "~="
     "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
     "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
     ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
     "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
     "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
     "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"))
(global-ligature-mode)
#+END_SRC

** LSP
eglot is built into emacs 29. install if not found.
#+BEGIN_SRC emacs-lisp
(unless (boundp 'eglot)
  (sup 'eglot))


(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs '(python-ts-mode . ("pyright-langserver" "--stdio"))))
(add-to-hooks #'eglot-ensure 'python-mode-hook 'python-ts-mode-hook)
#+END_SRC

turn off bold symbol highlighting

#+BEGIN_SRC emacs-lisp
(custom-set-faces
 '(eglot-highlight-symbol-face ((t (:inherit nil)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(add-fs-to-hook 'flymake-mode-hook (define-key flymake-mode-map (kbd "C-c C-n") #'flymake-goto-next-error))
#+END_SRC

** Grep
Deadgrep offers (imo) the best interface to ripgrep, a fast text
searcher. In the interest of portability, it is only installed if the
ripgrep binary, "rg" is also installed

#+BEGIN_SRC emacs-lisp
(when (executable-find "rg")
  (sup 'deadgrep))
#+END_SRC
** AI
#+BEGIN_SRC emacs-lisp
(sup 'gptel)
(with-eval-after-load 'gptel
  (setcdr (assoc 'default gptel-directives)
          (cdr (assoc 'programming gptel-directives))))
#+END_SRC
** Language-specific config
*** Haskell
Interactive haskell mode lets you use the nice repl with ~C-c C-z~
#+BEGIN_SRC emacs-lisp
(sup 'haskell-mode)
(add-hook 'haskell-mode-hook #'interactive-haskell-mode)
#+END_SRC

Interactive haskell error customization
#+BEGIN_SRC emacs-lisp
(setq haskell-interactive-popup-errors t)
#+END_SRC

*** C-style
#+BEGIN_SRC emacs-lisp
(when treesit-available
  (treesit-ensure 'c)
  (treesit-ensure 'cpp)
  (add-to-list 'major-mode-remap-alist
               '(c-mode . c-ts-mode)))

(setq-default c-basic-offset 4
              kill-whole-line t
              indent-tabs-mode nil)
#+END_SRC

*** Lisp
The best common lisp ide!
#+BEGIN_SRC emacs-lisp
(sup 'slime)
(setq inferior-lisp-program "sbcl")
(sup 'slime-company)
(add-fs-to-hook 'common-lisp-mode-hook (slime-setup '(slime-fancy slime-company)))
(add-hook 'lisp-mode-hook #'flycheck-mode)
#+END_SRC

Keeps code indented no matter what. This package is extremely broken
for most block based languages, but works like a charm for lisps.
#+BEGIN_SRC emacs-lisp
(sup 'aggressive-indent-mode)
(add-hook 'lisp-data-mode-hook #'aggressive-indent-mode 1)
#+END_SRC

**** Smartparens
#+BEGIN_SRC emacs-lisp
(smartparens-global-mode)
#+END_SRC

Define a function to disable auto quote-completion. This is
annoying in lisplike languages.

#+BEGIN_SRC emacs-lisp
(defun sp-disable (mode str)
  (sp-local-pair mode str nil :actions nil))
#+END_SRC

Disable single quote pairing in lisp-data modes
#+BEGIN_SRC emacs-lisp
(sp-disable 'lisp-data-mode "'")
#+END_SRC

**** Racket
#+BEGIN_SRC emacs-lisp
(sup 'racket-mode)
(sup 'scribble-mode)
#+END_SRC

**** Clojure
Cider is really good
#+BEGIN_SRC emacs-lisp
(sup 'clojure-mode)
(sup 'cider)
(sp-disable 'clojure-mode "'")
#+END_SRC

**** Elisp
#+BEGIN_SRC emacs-lisp
(sup 'elisp-format)
(setq elisp-format-column 80)
(sp-disable 'emacs-lisp-mode "'")
(sp-disable 'emacs-lisp-mode "`")
(sp-disable 'org-mode "'")
#+END_SRC

*** TeX
AuCTeX offers a lot of sweet features that I’ve come to take for granted
#+BEGIN_SRC emacs-lisp
(sup 'auctex)
(setq TeX-parse-self t)
#+END_SRC

TeX-parse-self enables parsing your \usepackages to give you more
options in the environment inserter (C-c C-e)

Use [[https://sioyek.info/][sioyek]] to view pdfs compiled with tex. Sioyek has some rough edges
to be sure, but it also has really cute features centered around
technical material.

I also include some fallbacks in order of my preference.

In order to add a custom tex viewing program, it must have an entry in
TeX-view-program-list that uses some expansion tokens that you're free
to copy from here.

#+BEGIN_SRC emacs-lisp
(setq pdf-viewer-exec-alist '((sioyek . "Sioyek")
                              (zathura . "Zathura")
                              (evince . "evince")
                              (okular . "Okular")))

(setq my-pdf-viewer (->> pdf-viewer-exec-alist
                         (-first (-compose #'executable-find #'symbol-name #'car))
                         cdr))

(add-fs-to-hook 'LaTeX-mode-hook
                (setq TeX-view-program-selection
                      `((output-pdf ,my-pdf-viewer)
                        (output-dvi ,my-pdf-viewer)
                        (output-html "xdg-open")))
                auto-fill-mode)
#+END_SRC

Reftex integration
#+BEGIN_SRC emacs-lisp
(add-hook 'LaTeX-mode-hook #'turn-on-reftex)
(setq reftex-plug-into-AUCTeX t)
#+END_SRC

Turn on tex-fold-mode
#+BEGIN_SRC emacs-lisp
(add-hook 'LaTeX-mode-hook #'TeX-fold-mode)
#+END_SRC

Make <tab> cycle sections just like in org mode
#+BEGIN_SRC emacs-lisp
(sup 'outline-magic)
(add-hook 'LaTeX-mode-hook #'outline-minor-mode)
(add-fs-to-hook 'LaTeX-mode-hook (define-key outline-minor-mode-map (kbd "<tab>") 'outline-cycle))
#+END_SRC

**** Don't auto-fill in some environments
#+BEGIN_SRC emacs-lisp
(defvar my-LaTeX-no-autofill-environments
  '("equation" "equation*", "tabular", "table")
  "A list of LaTeX environment names in which `auto-fill-mode' should be inhibited.")

(defun my-LaTeX-auto-fill-function ()
  "This function checks whether point is currently inside one of
the LaTeX environments listed in
`my-LaTeX-no-autofill-environments'. If so, it inhibits automatic
filling of the current paragraph."
  (let ((do-auto-fill t)
        (current-environment "")
        (level 0))
    (while (and do-auto-fill (not (string= current-environment "document")))
      (setq level (1+ level)
            current-environment (LaTeX-current-environment level)
            do-auto-fill (not (member current-environment my-LaTeX-no-autofill-environments))))
    (when do-auto-fill
      (do-auto-fill))))

(defun my-LaTeX-setup-auto-fill ()
  "This function turns on auto-fill-mode and sets the function
used to fill a paragraph to `my-LaTeX-auto-fill-function'."
  (interactive)
  (auto-fill-mode)
  (setq auto-fill-function 'my-LaTeX-auto-fill-function))

(add-hook 'LaTeX-mode-hook 'my-LaTeX-setup-auto-fill)

#+END_SRC

**** Japanese latex mode use dvipdfmx
Some journal templates for japanese organizations use [[https://github.com/texjporg/platex][platex]] rather
than latex. =japanese-latex-mode= tries to choose the correct
compilers, but for whatever reason fails to use dvipdfmx to convert
dvi to pdf.

#+BEGIN_SRC emacs-lisp
(advice-add #'japanese-latex-mode :after
            (lambda () (setq TeX-PDF-from-DVI "Dvipdfmx")))
#+END_SRC

*** Python
#+BEGIN_SRC emacs-lisp
(when treesit-available
  (treesit-ensure 'python)
  (add-to-list 'major-mode-remap-alist
               '(python-mode . python-ts-mode)))
(setq python-mode-hook-alias
      (if treesit-available
          'python-ts-mode-hook
        'python-mode-hook))
(setq python-mode-map-alias
      (if treesit-available
          'python-ts-mode-map
        'python-mode-map))
#+END_SRC

**** IPython
Make ipython the default shell
#+BEGIN_SRC emacs-lisp
(setq python-shell-interpreter "ipython"
      python-shell-interpreter-args "-i --simple-prompt --InteractiveShell.display_page=True")
#+END_SRC

conda env management
#+BEGIN_SRC emacs-lisp
(sup 'conda)
#+END_SRC

