home/emacs/conf/init.el

(global-prettify-symbols-mode)
(add-fs-to-hook 'emacs-lisp-mode-hook
                (push '("fn" . ?∅) prettify-symbols-alist))

(sup 'ligature)
(ligature-set-ligatures
 'prog-mode
 '(  "|||>" "<|||" "<==>" "<!--" "~~>" "***" "||=" "||>"   "://"
     ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
     "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
     "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
     "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
     "..." "+++" "/==" "///" "_|_" "&&" "^=" "~~" "~@" "~="
     "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
     "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
     ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
     "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
     "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
     "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"))
(global-ligature-mode)

(unless (boundp 'eglot)
  (sup 'eglot))


(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs '(python-ts-mode . ("pyright-langserver" "--stdio"))))
(add-to-hooks #'eglot-ensure 'python-mode-hook 'python-ts-mode-hook)

(custom-set-faces
 '(eglot-highlight-symbol-face ((t (:inherit nil)))))

(add-fs-to-hook 'flymake-mode-hook (define-key flymake-mode-map (kbd "C-c C-n") #'flymake-goto-next-error))

(when (executable-find "rg")
  (sup 'deadgrep))

(sup 'gptel)
(with-eval-after-load 'gptel
  (setcdr (assoc 'default gptel-directives)
          (cdr (assoc 'programming gptel-directives))))

(sup 'haskell-mode)
(add-hook 'haskell-mode-hook #'interactive-haskell-mode)

(setq haskell-interactive-popup-errors t)

(when treesit-available
  (treesit-ensure 'c)
  (treesit-ensure 'cpp)
  (add-to-list 'major-mode-remap-alist
               '(c-mode . c-ts-mode)))

(setq-default c-basic-offset 4
              kill-whole-line t
              indent-tabs-mode nil)

(sup 'slime)
(setq inferior-lisp-program "sbcl")
(sup 'slime-company)
(add-fs-to-hook 'common-lisp-mode-hook (slime-setup '(slime-fancy slime-company)))
(add-hook 'lisp-mode-hook #'flycheck-mode)

(sup 'aggressive-indent-mode)
(add-hook 'lisp-data-mode-hook #'aggressive-indent-mode 1)

(smartparens-global-mode)

(defun sp-disable (mode str)
  (sp-local-pair mode str nil :actions nil))

(sp-disable 'lisp-data-mode "'")

(sup 'racket-mode)
(sup 'scribble-mode)

(sup 'clojure-mode)
(sup 'cider)
(sp-disable 'clojure-mode "'")

(sup 'elisp-format)
(setq elisp-format-column 80)
(sp-disable 'emacs-lisp-mode "'")
(sp-disable 'emacs-lisp-mode "`")
(sp-disable 'org-mode "'")

(sup 'auctex)
(setq TeX-parse-self t)

(setq pdf-viewer-exec-alist '((sioyek . "Sioyek")
                              (zathura . "Zathura")
                              (evince . "evince")
                              (okular . "Okular")))

(setq my-pdf-viewer (->> pdf-viewer-exec-alist
                         (-first (-compose #'executable-find #'symbol-name #'car))
                         cdr))

(add-fs-to-hook 'LaTeX-mode-hook
                (setq TeX-view-program-selection
                      `((output-pdf ,my-pdf-viewer)
                        (output-dvi ,my-pdf-viewer)
                        (output-html "xdg-open")))
                auto-fill-mode)

(add-hook 'LaTeX-mode-hook #'turn-on-reftex)
(setq reftex-plug-into-AUCTeX t)

(add-hook 'LaTeX-mode-hook #'TeX-fold-mode)

(sup 'outline-magic)
(add-hook 'LaTeX-mode-hook #'outline-minor-mode)
(add-fs-to-hook 'LaTeX-mode-hook (define-key outline-minor-mode-map (kbd "<tab>") 'outline-cycle))

(defvar my-LaTeX-no-autofill-environments
  '("equation" "equation*", "tabular", "table")
  "A list of LaTeX environment names in which `auto-fill-mode' should be inhibited.")

(defun my-LaTeX-auto-fill-function ()
  "This function checks whether point is currently inside one of
the LaTeX environments listed in
`my-LaTeX-no-autofill-environments'. If so, it inhibits automatic
filling of the current paragraph."
  (let ((do-auto-fill t)
        (current-environment "")
        (level 0))
    (while (and do-auto-fill (not (string= current-environment "document")))
      (setq level (1+ level)
            current-environment (LaTeX-current-environment level)
            do-auto-fill (not (member current-environment my-LaTeX-no-autofill-environments))))
    (when do-auto-fill
      (do-auto-fill))))

(defun my-LaTeX-setup-auto-fill ()
  "This function turns on auto-fill-mode and sets the function
used to fill a paragraph to `my-LaTeX-auto-fill-function'."
  (interactive)
  (auto-fill-mode)
  (setq auto-fill-function 'my-LaTeX-auto-fill-function))

(add-hook 'LaTeX-mode-hook 'my-LaTeX-setup-auto-fill)

(advice-add #'japanese-latex-mode :after
            (lambda () (setq TeX-PDF-from-DVI "Dvipdfmx")))

(when treesit-available
  (treesit-ensure 'python)
  (add-to-list 'major-mode-remap-alist
               '(python-mode . python-ts-mode)))
(setq python-mode-hook-alias
      (if treesit-available
          'python-ts-mode-hook
        'python-mode-hook))
(setq python-mode-map-alias
      (if treesit-available
          'python-ts-mode-map
        'python-mode-map))

(setq python-shell-interpreter "ipython"
      python-shell-interpreter-args "-i --simple-prompt --InteractiveShell.display_page=True")

(sup 'conda)

(sup '(campus
       :type git
       :fetcher github
