home/emacs/conf/init.org
**** Campus
A small package I wrote to make repl interaction cleaner
#+BEGIN_SRC emacs-lisp
(sup '(campus
       :type git
       :fetcher github
       :repo "https://github.com/eshrh/campus-emacs"
       :files ("*.el")))

(if treesit-available
    (add-fs-to-hook 'python-ts-mode-hook
                    (define-key python-ts-mode-map (kbd "C-c C-l")
                                #'python-shell-send-buffer)
                    (define-key python-ts-mode-map (kbd "C-c + +")
                                #'campus-make-partition)
                    (define-key python-ts-mode-map (kbd "C-c + -")
                                #'campus-remove-partition-forward)
                    (define-key python-ts-mode-map (kbd "C-c C-c")
                                #'campus-send-region))
    (add-fs-to-hook 'python-mode-hook
                    (define-key python-mode-map (kbd "C-c C-l")
                                #'python-shell-send-buffer)
                    (define-key python-mode-map (kbd "C-c + +")
                                #'campus-make-partition)
                    (define-key python-mode-map (kbd "C-c + -")
                                #'campus-remove-partition-forward)
                    (define-key python-mode-map (kbd "C-c C-c")
                                #'campus-send-region)))
#+END_SRC

**** Make describe at point functional
Default describe at point function sends the symbols to the python
process as a string. This means it will never work for functions
imported from somewhere. I therefore redefine this function here

#+BEGIN_SRC emacs-lisp
(defun python-describe-at-point1 (symbol process)
  (interactive (list (python-info-current-symbol)
                     (python-shell-get-process)))
  (comint-send-string process (concat "help(" symbol ")\n")))

(advice-add #'python-describe-at-point :override #'python-describe-at-point1)
#+END_SRC

**** Extra convenience bindings
Ipython with =%matplotlib= QtAgg lets you throw up a window and
repeatedly reuse it for different figures. This is a cool feature, but
it leads to me calling =plt.clf()= really often.

#+BEGIN_SRC emacs-lisp
(defun python-clear-matplotlib ()
  (interactive)
  (python-shell-send-string-no-output "plt.clf()")
  (message "Matplotlib plot cleared."))

(if treesit-available
    (add-fs-to-hook 'python-ts-mode-hook
                (define-key python-ts-mode-map (kbd "C-c C-,")
                  #'python-clear-matplotlib))
  (add-fs-to-hook 'python-mode-hook
                (define-key python-mode-map (kbd "C-c C-,")
                  #'python-clear-matplotlib)))
#+END_SRC

**** Symbols via prettify
Some people will call this deranged. I don't care.
#+BEGIN_SRC emacs-lisp
(add-fs-to-hook (if treesit-available 'python-ts-mode-hook 'python-mode-hook)
                (push '("None" . ?∅) prettify-symbols-alist)
                (push '("return" . ?») prettify-symbols-alist)) ;❱)
#+END_SRC

*** Other
#+BEGIN_SRC emacs-lisp
(sup '(kbd-mode
       :type git
       :repo "https://github.com/kmonad/kbd-mode"))
(add-hook 'kbd-mode-hook (fn (aggressive-indent-mode -1)))

(sup 'rust-mode)
(when treesit-available
    (treesit-ensure 'rust)
    (setq rust-mode-treesitter-derive t))


(sup '(matsurika-mode
       :type git
       :host github
       :repo "eshrh/matsurika-mode"
       :files ("*.el" "docs.txt")))

(sup 'nix-mode)

(sup 'julia-snail)
(add-hook 'julia-mode-hook #'julia-snail-mode)

(sup 'markdown-mode)

(add-fs-to-hook 'java-mode-hook
                flycheck-mode
                (setq c-basic-offset 4)
                (setq tab-width 4))


(add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
(add-to-hooks #'eglot-ensure 'tsx-ts-mode-hook)
(setq js-indent-level 4)
#+END_SRC

* Other config and elisp
** User information
Add some variables that various programs, especially mail programs
use.
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Eshan Ramesh"
      user-mail-address "esrh@esrh.me")
#+END_SRC

** Yes or no to y/n
Turn the yes or no prompts into y or n prompts. This makes it easier
and faster to type since emacs will insist you type out y e s.
#+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** Don't ask about vc links
Don't ask for confirmation when i visit a git-controlled source file.
This is especially helpful when you want to get to a build file from a
help page from some package installed by straight.
#+BEGIN_SRC emacs-lisp
(setq vc-follow-symlinks nil)
#+END_SRC

** Don't confirm on buffer kill
Living dangerously! Don't confirm when killing a buffer.
#+BEGIN_SRC emacs-lisp
(setq kill-buffer-query-functions
      (delq 'process-kill-buffer-query-function kill-buffer-query-functions))
#+END_SRC

** Temporary files in /tmp
Taken from emacswiki. Makes emacs stop littering your working
directories with autosave information. Instead, leave them all in
~/tmp/emacsXXXX~  where ~XXXX~ is a user unique id (which prevents
multiple users (who don't exist on my computers) from having
conflicting auto save files).

#+BEGIN_SRC emacs-lisp
(defconst emacs-tmp-dir
  (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))
(setq backup-directory-alist
      `((".*" . ,emacs-tmp-dir)))
(setq auto-save-file-name-transforms
      `((".*" ,emacs-tmp-dir t)))
(setq auto-save-list-file-prefix
      emacs-tmp-dir)
#+END_SRC

** Make directories in find-file
#+BEGIN_SRC emacs-lisp
(defadvice find-file (before make-directory-maybe (filename &optional wildcards) activate)
  "Create parent directory if not exists while visiting file."
  (unless (file-exists-p filename)
    (let ((dir (file-name-directory filename)))
      (unless (file-exists-p dir)
        (make-directory dir t)))))
#+END_SRC

** Split and follow
Does what it says on the tin. I feel like everyone has some version of
these functions copied from somewhere or another on the internet.
#+BEGIN_SRC emacs-lisp
(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))
#+END_SRC

Bind these new functions to override the old ones
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+END_SRC

** Delete frame and buffer
Taken from [[https://emacs.stackexchange.com/questions/2888/kill-buffer-when-frame-is-deleted][here]]
#+BEGIN_SRC emacs-lisp
(defun maybe-delete-frame-buffer (frame)
  "When a dedicated FRAME is deleted, also kill its buffer.
  A dedicated frame contains a single window whose buffer is not
  displayed anywhere else."
  (let ((windows (window-list frame)))
    (when (eq 1 (length windows))
      (let ((buffer (window-buffer (car windows))))
        (when (eq 1 (length (get-buffer-window-list buffer nil t)))
          (kill-buffer buffer))))))
(add-hook 'delete-frame-functions #'maybe-delete-frame-buffer)
#+END_SRC

** Custom keybinds
*** Kill both buffer and window keybinding
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x k") 'kill-buffer)
(global-set-key (kbd "C-x C-k") 'kill-buffer-and-window)
#+END_SRC

*** Comment or uncomment
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c /") #'comment-or-uncomment-region)
#+END_SRC
** Spellcheck locale
Taken from here: http://blog.binchen.org/posts/what-s-the-best-spell-check-set-up-in-emacs/
#+BEGIN_SRC emacs-lisp
(cond
 ;; try hunspell at first
  ;; if hunspell does NOT exist, use aspell
 ((executable-find "hunspell")
  (setq ispell-program-name "hunspell")
  (setq ispell-local-dictionary "en_US")
  (setq ispell-local-dictionary-alist
        ;; Please note the list `("-d" "en_US")` contains ACTUAL parameters passed to hunspell
        ;; You could use `("-d" "en_US,en_US-med")` to check with multiple dictionaries
        '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)))

  ;; new variable `ispell-hunspell-dictionary-alist' is defined in Emacs
  ;; If it's nil, Emacs tries to automatically set up the dictionaries.
  (when (boundp 'ispell-hunspell-dictionary-alist)
    (setq ispell-hunspell-dictionary-alist ispell-local-dictionary-alist)))

 ((executable-find "aspell")
  (setq ispell-program-name "aspell")
  ;; Please note ispell-extra-args contains ACTUAL parameters passed to aspell
  (setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_US"))))
#+END_SRC

** Function to reload init
I make too many changes to type this out every time.
#+BEGIN_SRC emacs-lisp
(defun load-init ()
  (interactive)
  (load-file (expand-file-name "init.el" user-emacs-directory)))
#+END_SRC

** Load current file
#+BEGIN_SRC emacs-lisp
(defun load-this-file ()
  (interactive)
  (load-file (buffer-file-name)))

(define-key emacs-lisp-mode-map (kbd "C-c C-b") 'load-this-file)
#+END_SRC

** Kill other buffers
#+BEGIN_SRC emacs-lisp
(defun kill-other-buffers ()
  "Kill all other buffers."
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))
#+END_SRC

** Final newline
#+BEGIN_SRC emacs-lisp
(setq mode-require-final-newline t)
#+END_SRC

** Scratch config
Set the initial mode to be lisp interaction. No default text.
#+BEGIN_SRC emacs-lisp
(setq initial-major-mode 'lisp-interaction-mode)
(setq initial-scratch-message "")
#+END_SRC

** Don't confirm exiting when active processes exist
#+BEGIN_SRC emacs-lisp
(setq confirm-kill-processes nil)
#+END_SRC

