home/emacs/conf/init.el
       :repo "https://github.com/eshrh/campus-emacs"
       :files ("*.el")))

(if treesit-available
    (add-fs-to-hook 'python-ts-mode-hook
                    (define-key python-ts-mode-map (kbd "C-c C-l")
                                #'python-shell-send-buffer)
                    (define-key python-ts-mode-map (kbd "C-c + +")
                                #'campus-make-partition)
                    (define-key python-ts-mode-map (kbd "C-c + -")
                                #'campus-remove-partition-forward)
                    (define-key python-ts-mode-map (kbd "C-c C-c")
                                #'campus-send-region))
    (add-fs-to-hook 'python-mode-hook
                    (define-key python-mode-map (kbd "C-c C-l")
                                #'python-shell-send-buffer)
                    (define-key python-mode-map (kbd "C-c + +")
                                #'campus-make-partition)
                    (define-key python-mode-map (kbd "C-c + -")
                                #'campus-remove-partition-forward)
                    (define-key python-mode-map (kbd "C-c C-c")
                                #'campus-send-region)))

(defun python-describe-at-point1 (symbol process)
  (interactive (list (python-info-current-symbol)
                     (python-shell-get-process)))
  (comint-send-string process (concat "help(" symbol ")\n")))

(advice-add #'python-describe-at-point :override #'python-describe-at-point1)

(defun python-clear-matplotlib ()
  (interactive)
  (python-shell-send-string-no-output "plt.clf()")
  (message "Matplotlib plot cleared."))

(if treesit-available
    (add-fs-to-hook 'python-ts-mode-hook
                (define-key python-ts-mode-map (kbd "C-c C-,")
                  #'python-clear-matplotlib))
  (add-fs-to-hook 'python-mode-hook
                (define-key python-mode-map (kbd "C-c C-,")
                  #'python-clear-matplotlib)))

(add-fs-to-hook (if treesit-available 'python-ts-mode-hook 'python-mode-hook)
                (push '("None" . ?∅) prettify-symbols-alist)
                (push '("return" . ?») prettify-symbols-alist)) ;❱)

(sup '(kbd-mode
       :type git
       :repo "https://github.com/kmonad/kbd-mode"))
(add-hook 'kbd-mode-hook (fn (aggressive-indent-mode -1)))

(sup 'rust-mode)
(when treesit-available
    (treesit-ensure 'rust)
    (setq rust-mode-treesitter-derive t))


(sup '(matsurika-mode
       :type git
       :host github
       :repo "eshrh/matsurika-mode"
       :files ("*.el" "docs.txt")))

(sup 'nix-mode)

(sup 'julia-snail)
(add-hook 'julia-mode-hook #'julia-snail-mode)

(sup 'markdown-mode)

(add-fs-to-hook 'java-mode-hook
                flycheck-mode
                (setq c-basic-offset 4)
                (setq tab-width 4))


(add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode))
(add-to-hooks #'eglot-ensure 'tsx-ts-mode-hook)
(setq js-indent-level 4)

(setq user-full-name "Eshan Ramesh"
      user-mail-address "esrh@esrh.me")

(defalias 'yes-or-no-p 'y-or-n-p)

(setq vc-follow-symlinks nil)

(setq kill-buffer-query-functions
      (delq 'process-kill-buffer-query-function kill-buffer-query-functions))

(defconst emacs-tmp-dir
  (expand-file-name (format "emacs%d" (user-uid)) temporary-file-directory))
(setq backup-directory-alist
      `((".*" . ,emacs-tmp-dir)))
(setq auto-save-file-name-transforms
      `((".*" ,emacs-tmp-dir t)))
(setq auto-save-list-file-prefix
      emacs-tmp-dir)

(defadvice find-file (before make-directory-maybe (filename &optional wildcards) activate)
  "Create parent directory if not exists while visiting file."
  (unless (file-exists-p filename)
    (let ((dir (file-name-directory filename)))
      (unless (file-exists-p dir)
        (make-directory dir t)))))

(defun split-and-follow-horizontally ()
  (interactive)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(defun split-and-follow-vertically ()
  (interactive)
  (split-window-right)
  (balance-windows)
  (other-window 1))

(global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)
(global-set-key (kbd "C-x 3") 'split-and-follow-vertically)

(defun maybe-delete-frame-buffer (frame)
  "When a dedicated FRAME is deleted, also kill its buffer.
  A dedicated frame contains a single window whose buffer is not
  displayed anywhere else."
  (let ((windows (window-list frame)))
    (when (eq 1 (length windows))
      (let ((buffer (window-buffer (car windows))))
        (when (eq 1 (length (get-buffer-window-list buffer nil t)))
          (kill-buffer buffer))))))
(add-hook 'delete-frame-functions #'maybe-delete-frame-buffer)

(global-set-key (kbd "C-x k") 'kill-buffer)
(global-set-key (kbd "C-x C-k") 'kill-buffer-and-window)

(global-set-key (kbd "C-c /") #'comment-or-uncomment-region)

(cond
 ;; try hunspell at first
  ;; if hunspell does NOT exist, use aspell
 ((executable-find "hunspell")
  (setq ispell-program-name "hunspell")
  (setq ispell-local-dictionary "en_US")
  (setq ispell-local-dictionary-alist
        ;; Please note the list `("-d" "en_US")` contains ACTUAL parameters passed to hunspell
        ;; You could use `("-d" "en_US,en_US-med")` to check with multiple dictionaries
        '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)))

  ;; new variable `ispell-hunspell-dictionary-alist' is defined in Emacs
  ;; If it's nil, Emacs tries to automatically set up the dictionaries.
  (when (boundp 'ispell-hunspell-dictionary-alist)
    (setq ispell-hunspell-dictionary-alist ispell-local-dictionary-alist)))

 ((executable-find "aspell")
  (setq ispell-program-name "aspell")
  ;; Please note ispell-extra-args contains ACTUAL parameters passed to aspell
  (setq ispell-extra-args '("--sug-mode=ultra" "--lang=en_US"))))

(defun load-init ()
  (interactive)
  (load-file (expand-file-name "init.el" user-emacs-directory)))

(defun load-this-file ()
  (interactive)
  (load-file (buffer-file-name)))

(define-key emacs-lisp-mode-map (kbd "C-c C-b") 'load-this-file)

(defun kill-other-buffers ()
  "Kill all other buffers."
  (interactive)
  (mapc 'kill-buffer (delq (current-buffer) (buffer-list))))

(setq mode-require-final-newline t)

(setq initial-major-mode 'lisp-interaction-mode)
(setq initial-scratch-message "")

(setq confirm-kill-processes nil)
