home/emacs/conf/init.org
** Comint keybindings
#+BEGIN_SRC emacs-lisp
(define-key comint-mode-map (kbd "C-p") #'comint-previous-input)
(define-key comint-mode-map (kbd "C-n") #'comint-next-input)
(define-key comint-mode-map (kbd "C-w") #'backward-kill-word)
#+END_SRC
